[
  {
    "image": "https://i.ibb.co.com/TM2PW6yv/unnamed.png",
    "title": "QuickChat",
    "companyName": "Chatter Inc.",
    "id": 1,
    "description": "QuickChat is a messaging app that allows users to chat in real-time. It supports both text and multimedia messages. Users can make voice and video calls globally. It offers end-to-end encryption for secure communication. Group chats and file sharing are also available. Notifications are customizable per conversation. It integrates easily with contacts and social media. Offline messages are automatically synced once online. The interface is clean and user-friendly. It supports dark mode and chat themes.",
    "size": 35,
    "reviews": 12452,
    "ratingAvg": 4.3,
    "downloads": 5,
    "whyUsed": "for instant messaging",
    "ratings": [
      { "name": "1 star", "count": 523 },
      { "name": "2 star", "count": 764 },
      { "name": "3 star", "count": 1021 },
      { "name": "4 star", "count": 3324 },
      { "name": "5 star", "count": 6820 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bMxVV7WH/fitness.png",
    "title": "FitnessPro",
    "companyName": "HealthMate",
    "id": 2,
    "description": "FitnessPro is your all-in-one fitness companion. It tracks your daily workouts and step count. Calorie tracking and water intake reminders are included. It allows goal setting and provides progress reports. Personal workout plans are generated using AI. The app includes yoga, HIIT, and strength exercises. FitnessPro supports fitness device syncing like smartwatches. It provides motivational tips and health articles. You can also join fitness challenges with friends. All features are customizable to user needs.",
    "size": 58,
    "reviews": 9843,
    "ratingAvg": 4.6,
    "downloads": 2,
    "whyUsed": "for workout tracking",
    "ratings": [
      { "name": "1 star", "count": 190 },
      { "name": "2 star", "count": 310 },
      { "name": "3 star", "count": 780 },
      { "name": "4 star", "count": 2763 },
      { "name": "5 star", "count": 5800 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/1fF50G5s/tune.webp",
    "title": "MusicMix",
    "companyName": "TunePlay",
    "id": 3,
    "description": "MusicMix is a music streaming app with a massive library. You can listen to millions of tracks online. It allows creation and sharing of playlists. The app recommends music based on your taste. Offline downloads are available for premium users. Users can follow artists and get updates. MusicMix offers lyrics for most songs. Audio quality can be adjusted for data savings. It includes radio stations and mood playlists. Social features let you see what friends are listening to.",
    "size": 72,
    "reviews": 23342,
    "ratingAvg": 4.1,
    "downloads": 8,
    "whyUsed": "for streaming music",
    "ratings": [
      { "name": "1 star", "count": 1300 },
      { "name": "2 star", "count": 1800 },
      { "name": "3 star", "count": 3200 },
      { "name": "4 star", "count": 5100 },
      { "name": "5 star", "count": 11942 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/fd7mSC1v/pixelperfect.webp",
    "title": "PhotoEdit+",
    "companyName": "PixelPerfect",
    "id": 4,
    "description": "PhotoEdit+ is a powerful photo editor for all skill levels. It offers one-tap filters and AI enhancements. You can adjust brightness, contrast, and saturation. It includes cropping, resizing, and background removal. The app supports adding text and stickers to images. Batch editing is available for convenience. Professional tools like curves and HSL are included. You can create collages and photo grids. Sharing to social media is built-in. Tutorials guide beginners through every feature.",
    "size": 85,
    "reviews": 17895,
    "ratingAvg": 4.7,
    "downloads": 35,
    "whyUsed": "for photo editing",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 460 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 11735 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/k6PdM65K/finance.webp",
    "title": "SmartBudget",
    "companyName": "FinanceTech",
    "id": 5,
    "description": "SmartBudget helps you track expenses and save money. It automatically categorizes transactions. Users can set monthly spending limits. It links with bank accounts securely. The app provides visual reports of your finances. You can track savings goals over time. It sends reminders for upcoming bills. Exporting financial data is supported. The app helps users reduce unnecessary spending. Everything is stored locally with optional cloud backup.",
    "size": 28,
    "reviews": 8561,
    "ratingAvg": 4.2,
    "downloads": 15,
    "whyUsed": "to track expenses",
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 430 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2845 },
      { "name": "5 star", "count": 3936 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/9mpM7qBn/edu.webp",
    "title": "LangLearn",
    "companyName": "EduWorld",
    "id": 6,
    "description": "LangLearn is a language learning platform. It supports over 20 languages with daily lessons. Lessons include speaking, reading, and listening practice. Gamified quizzes help reinforce learning. Flashcards and spaced repetition are available. It tracks your daily streak and progress. You can speak with native speakers via chat. LangLearn uses AI to personalize lessons. Offline mode is available for travelers. It’s suitable for both kids and adults.",
    "size": 49,
    "reviews": 12100,
    "ratingAvg": 4.5,
    "downloads": 30,
    "whyUsed": "to learn languages",
    "ratings": [
      { "name": "1 star", "count": 320 },
      { "name": "2 star", "count": 510 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 3100 },
      { "name": "5 star", "count": 6670 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/23ZJPLV3/global-news.png",
    "title": "NewsDaily",
    "companyName": "GlobalNews Ltd.",
    "id": 7,
    "description": "NewsDaily keeps you updated with global news. It covers politics, sports, tech, and more. Articles are updated every few minutes. You can customize your news feed. Push notifications highlight breaking news. NewsDaily offers both video and audio summaries. Offline reading is available for saved articles. The app avoids clickbait headlines. It sources news from credible outlets. Readers can comment and react to stories.",
    "size": 40,
    "reviews": 15700,
    "ratingAvg": 3.9,
    "downloads": 40,
    "whyUsed": "for reading news",
    "ratings": [
      { "name": "1 star", "count": 2100 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 2800 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 6100 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YFT0RPdF/cook.png",
    "title": "RecipeHub",
    "companyName": "CookBook Apps",
    "id": 8,
    "description": "RecipeHub offers thousands of curated recipes. You can browse by ingredient, cuisine, or diet. Step-by-step instructions with timers are included. Users can save favorite recipes to their profile. Meal planning and grocery lists are built-in. Recipes include nutrition facts and tips. Upload and share your own recipes too. Video tutorials help visual learners cook better. A community forum allows discussions and ratings. Seasonal and trending recipes are highlighted daily.",
    "size": 63,
    "reviews": 64,
    "ratingAvg": 4.4,
    "downloads": 1100000,
    "whyUsed": "for cooking recipes",
    "ratings": [
      { "name": "1 star", "count": 180 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 3120 }
    ]
  }
]
