
  {
    "image": "https://example.com/images/chatapp.png",
    "title": "QuickChat",
    "companyName": "Chatter Inc.",
    "id": 1,
    "description": "QuickChat is a messaging app that allows users to chat in real-time. It supports both text and multimedia messages. Users can make voice and video calls globally. It offers end-to-end encryption for secure communication. Group chats and file sharing are also available. Notifications are customizable per conversation. It integrates easily with contacts and social media. Offline messages are automatically synced once online. The interface is clean and user-friendly. It supports dark mode and chat themes.",
    "size": 35,
    "reviews": 12452,
    "ratingAvg": 4.3,
    "downloads": 5.0,
    "whyUsed": "for instant messaging",
    "ratings": [
      {
        "name": "1 star",
        "count": 523
      },
      {
        "name": "2 star",
        "count": 764
      },
      {
        "name": "3 star",
        "count": 1021
      },
      {
        "name": "4 star",
        "count": 3324
      },
      {
        "name": "5 star",
        "count": 6820
      }
    ]
  },
  {
    "image": "https://example.com/images/fitnesspro.png",
    "title": "FitnessPro",
    "companyName": "HealthMate",
    "id": 2,
    "description": "FitnessPro is your all-in-one fitness companion. It tracks your daily workouts and step count. Calorie tracking and water intake reminders are included. It allows goal setting and provides progress reports. Personal workout plans are generated using AI. The app includes yoga, HIIT, and strength exercises. FitnessPro supports fitness device syncing like smartwatches. It provides motivational tips and health articles. You can also join fitness challenges with friends. All features are customizable to user needs.",
    "size": 58,
    "reviews": 9843,
    "ratingAvg": 4.6,
    "downloads": 2.0,
    "whyUsed": "for workout tracking",
    "ratings": [
      {
        "name": "1 star",
        "count": 190
      },
      {
        "name": "2 star",
        "count": 310
      },
      {
        "name": "3 star",
        "count": 780
      },
      {
        "name": "4 star",
        "count": 2763
      },
      {
        "name": "5 star",
        "count": 5800
      }
    ]
  }
]